<?php


if (! function_exists('true_wordform')) {
    /*
 * $num число, від якого залежатиме форма слова
 * $form_for_1 перша форма слова, наприклад Коментар
 * $form_for_2 друга форма слова - Коментар
 * $form_for_5 третя форма множини слова - Коментарів
*/
    function true_wordform($num, $form_for_0, $form_for_1, $form_for_2, $form_for_5){
        $num = abs($num) % 100; // беремо число за модулем і скидаємо сотні (ділимо на 100, а залишок присвоюємо змінною $num)
        $num_x = $num % 10; // скидаємо десятки та записуємо в нову змінну
        if ($num == 0) // якщо число належить відрізку [11; 19]
            return $form_for_0;
        if ($num > 10 && $num < 20) // якщо число належить відрізку [11; 19]
            return $form_for_5;
        if ($num_x > 1 && $num_x < 5) // інакше, якщо число закінчується на 2,3,4
            return $form_for_2;
        if ($num_x == 1) // інакше якщо закінчується на 1
            return $form_for_1;
        return $form_for_5;
    }

}
